"""
3. 将输入内容进行转换
int()：将一个数值或字符串转换成整数，可以指定进制。
float()：将一个字符串转换成浮点数。
str()：将指定的对象转换成字符串形式，可以指定编码。
chr()：将整数转换成该编码对应的字符串（一个字符）。
ord()：将字符串（一个字符）转换成对应的编码（整数）。
"""
a = int(input("a = "))  # 3
b = int(input("b = "))  # 2
print('%d + %d = %d' % (a, b, a + b))   # 5
print('%d - %d = %d' % (a, b, a - b))   # 1
print('%d * %d = %d' % (a, b, a * b))   # 6
print('%d / %d = %f' % (a, b, a / b))   # 1.500000
print('%d // %d = %d' % (a, b, a // b)) # 1
print('%d %% %d = %d' % (a, b, a % b))  # 1
print('%d ** %d = %d' % (a, b, a ** b)) # 9
